<template>
  <div>
    <Row>
      <Col
        span="6"
        v-for="item in articleitem"
        :key="item.name"
      >
      <div class="index_article_div">
        <Card
          class="index_article_card"
        >
          <h2 slot="title">{{item.name}}</h2>
          <p>{{item.content | ellipsis}}</p>
        </Card>
      </div>
      </Col>
    </Row>

  </div>
</template>

<script>
export default {
  filters: {
    ellipsis (value) {
      if (!value) { return '' }
      if (value.length > 8) {
        return value.slice(0, 75) + '...'
      }
      return value
    }
  },
  data () {
    return {
      articleitem: [
        {
          name: '茶文化的起源',
          content: '茶文化意为饮茶活动过程中形成的文化特征，包括茶道、茶德、茶精神、茶联、茶书、茶具、茶画、茶学、茶故事、茶艺等等。茶文化起源地为中国。中国是茶的故乡，中国饮茶，据说始于神农时代，少说也有4700多年了。直到现在，汉族还有民以茶代礼的风俗。汉族对茶的配制是多种多样的：有太湖的熏豆茶、苏州的香味茶、湖南的姜盐茶、蜀山的侠君茶、台湾的冻顶茶、杭州的龙井茶、福建的乌龙茶等。'
        },
        {
          name: '茶文化的起源',
          content: '茶文化意为饮茶活动过程中形成的文化特征，包括茶道、茶德、茶精神、茶联、茶书、茶具、茶画、茶学、茶故事、茶艺等等。茶文化起源地为中国。中国是茶的故乡，中国饮茶，据说始于神农时代，少说也有4700多年了。直到现在，汉族还有民以茶代礼的风俗。汉族对茶的配制是多种多样的：有太湖的熏豆茶、苏州的香味茶、湖南的姜盐茶、蜀山的侠君茶、台湾的冻顶茶、杭州的龙井茶、福建的乌龙茶等。'
        }, 
        {
          name: '茶文化的起源',
          content: '茶文化意为饮茶活动过程中形成的文化特征，包括茶道、茶德、茶精神、茶联、茶书、茶具、茶画、茶学、茶故事、茶艺等等。茶文化起源地为中国。中国是茶的故乡，中国饮茶，据说始于神农时代，少说也有4700多年了。直到现在，汉族还有民以茶代礼的风俗。汉族对茶的配制是多种多样的：有太湖的熏豆茶、苏州的香味茶、湖南的姜盐茶、蜀山的侠君茶、台湾的冻顶茶、杭州的龙井茶、福建的乌龙茶等。'
        }, 
        {
          name: '茶文化的起源',
          content: '茶文化意为饮茶活动过程中形成的文化特征，包括茶道、茶德、茶精神、茶联、茶书、茶具、茶画、茶学、茶故事、茶艺等等。茶文化起源地为中国。中国是茶的故乡，中国饮茶，据说始于神农时代，少说也有4700多年了。直到现在，汉族还有民以茶代礼的风俗。汉族对茶的配制是多种多样的：有太湖的熏豆茶、苏州的香味茶、湖南的姜盐茶、蜀山的侠君茶、台湾的冻顶茶、杭州的龙井茶、福建的乌龙茶等。'
        }
      ]
    }
  }
}
</script>

<style scoped>
@import "@/assets/frontpage/frontcomp/indexpage.css";
</style>